<a href="https://colab.research.google.com/github/aneeshoberoi/pandas_exercises-1/blob/master/01_Getting_%26_Knowing_Your_Data/Occupation/Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [3]:
raw_df=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|')

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [6]:
users=raw_df
users.set_index('user_id', inplace=True)

### Step 4. See the first 25 entries

In [7]:
users.head(n=25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [8]:
users.tail(n=10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [9]:
len(users)

943

### Step 7. What is the number of columns in the dataset?

In [12]:
users.shape
users.columns

Index([u'age', u'gender', u'occupation', u'zip_code'], dtype='object')

### Step 8. Print the name of all the columns.

### Step 9. How is the dataset indexed?

In [13]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name=u'user_id', length=943)

### Step 10. What is the data type of each column?

In [15]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### Step 11. Print only the occupation column

In [16]:
users.occupation.head()

user_id
1    technician
2         other
3        writer
4    technician
5         other
Name: occupation, dtype: object

### Step 12. How many different occupations are in this dataset?

In [18]:
users.occupation.nunique()

21

In [21]:
users.occupation.value_counts().sort_index() #sort_index sorts by index -- which is user_id here. value_counts just counts values and sorts by values

administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
Name: occupation, dtype: int64

### Step 13. What is the most frequent occupation?

In [28]:
occ=users.occupation.value_counts()
max1=occ.head(1) # can assign output to an array like this
print(max1)

student    196
Name: occupation, dtype: int64

### Step 14. Summarize the DataFrame.

In [31]:
users.describe(include='all') #gets string columns also

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 15. Summarize all the columns

### Step 16. Summarize only the occupation column

34.05196182396607

### Step 17. What is the mean age of users?

In [33]:
users.age.mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [36]:
users.age.value_counts(ascending=True)

7      1
66     1
73     1
10     1
11     1
62     2
69     2
68     2
64     2
58     3
59     3
61     3
70     3
65     3
14     3
63     3
54     4
16     5
13     5
15     6
56     6
52     6
60     9
57     9
41    10
55    11
53    12
46    12
43    13
47    14
      ..
45    15
38    17
34    17
18    18
37    19
49    19
48    20
50    20
51    20
42    21
36    21
40    21
39    22
44    23
19    23
31    25
33    26
21    27
35    27
23    28
32    28
20    32
29    32
24    33
26    34
27    35
28    36
22    37
25    38
30    39
Name: age, Length: 61, dtype: int64

In [37]:
pd.cut(users.age, 10).value_counts(ascending=True)

(6.934, 13.6]      8
(66.4, 73.0]       8
(59.8, 66.4]      23
(53.2, 59.8]      36
(40.0, 46.6]      94
(13.6, 20.2]     101
(46.6, 53.2]     111
(33.4, 40.0]     144
(20.2, 26.8]     197
(26.8, 33.4]     221
Name: age, dtype: int64

In [38]:
pd.cut(users.age, 10).value_counts(ascending=True) [:5]

(6.934, 13.6]     8
(66.4, 73.0]      8
(59.8, 66.4]     23
(53.2, 59.8]     36
(40.0, 46.6]     94
Name: age, dtype: int64